Revit 2024 API
ImageTypeOptions.SetExternalResourceReference Method
 Update the external resource reference to an image.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public void SetExternalResourceReference(
	ExternalResourceReference resourceReference
)
Visual Basic
Public Sub SetExternalResourceReference ( _
	resourceReference As ExternalResourceReference _
)
Visual C++
public:
void SetExternalResourceReference(
	ExternalResourceReference^ resourceReference
)
Parameters
resourceReference
Type: Autodesk.Revit.DB.ExternalResourceReference
 An external resource reference to an image.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ImageTypeOptions Class
Autodesk.Revit.DB Namespace